uhnp/src/InformationRegisters/ЗначенияСтатусовКлючевыхСрезов/ЗначенияСтатусовКлючевыхСрезов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСтатусовКлючевыхСрезов</name>
  <resources>
    <name>ЗначениеЗаблокировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИндексСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизационнаяЕдиница</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ЗначенияСтатусовПоказателейСинтетика/ЗначенияСтатусовПоказателейСинтетика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСтатусовПоказателейСинтетика</name>
  <resources>
    <name>ЗначениеЗаблокировано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИндексСостояния</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПравилоОбработки</name>
    <type>
      <types>CatalogRef.ПравилаОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийРедактировавший</name>
    <comment>Пользователь, внесший последние изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстКомментария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизационнаяЕдиница</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбластьДанных</name>
    <comment>(УХ)</comment>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ОбъектыСогласованияЗначенийПоказателейОтчетов/ОбъектыСогласованияЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбъектыСогласованияЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>ЭкземплярОтчета</name>
  </enumValues>
  <enumValues>
    <name>Ракурс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/InformationRegisters/ЗначенияСтатусовКлючевыхСрезов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
/////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура УдалитьЗаписиКлючевогоСреза(ДанныеСреза, Отказ) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияСтатусовКлючевыхСрезов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ВидОтчета", ДанныеСреза.ВидОтчета);
		ЭлементБлокировки.УстановитьЗначение("Сценарий", ДанныеСреза.Сценарий);
		Если ЗначениеЗаполнено(ДанныеСреза.Организация) Тогда
			ЭлементБлокировки.УстановитьЗначение("ОрганизационнаяЕдиница", ДанныеСреза.Организация);
		КонецЕсли;
		Периоды = ПолучитьПериодыБлокировки(ДанныеСреза.МассивПериодов);
		ЭлементБлокировки.ИсточникДанных = Периоды;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ПериодОтчета", "ПериодыОтчета");
		
		Если ЗначениеЗаполнено(ДанныеСреза.Проект) Тогда
			ЭлементБлокировки.УстановитьЗначение("Проект", ДанныеСреза.Проект);
		КонецЕсли;
		Если ДанныеСреза.МаксАналитикОтчета > 0 Тогда
			Для Номер = 1 По ДанныеСреза.МаксАналитикОтчета Цикл
				ЭлементБлокировки.УстановитьЗначение("Аналитика" + Номер, ДанныеСреза["Аналитика" + Номер]);
			КонецЦикла;
		КонецЕсли;
		Блокировка.Заблокировать();
		
		Для Каждого ПериодСреза Из ДанныеСреза.МассивПериодов Цикл
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидОтчета.Установить(ДанныеСреза.ВидОтчета);
			НаборЗаписей.Отбор.Сценарий.Установить(ДанныеСреза.Сценарий);
			Если ЗначениеЗаполнено(ДанныеСреза.Организация) Тогда
				НаборЗаписей.Отбор.ОрганизационнаяЕдиница.Установить(ДанныеСреза.Организация);
			КонецЕсли;
			НаборЗаписей.Отбор.ПериодОтчета.Установить(ПериодСреза);
			Если ЗначениеЗаполнено(ДанныеСреза.Проект) Тогда
				НаборЗаписей.Отбор.Проект.Установить(ДанныеСреза.Проект);
			КонецЕсли;
			
			Если ДанныеСреза.МаксАналитикОтчета > 0 Тогда
				Для Номер = 1 По ДанныеСреза.МаксАналитикОтчета Цикл
					НаборЗаписей.Отбор["Аналитика" + Номер].Установить(ДанныеСреза["Аналитика" + Номер]);
				КонецЦикла;
			КонецЕсли;
			
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ОбработатьОшибкуУдаленияЗаписей();
		Отказ = Истина;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьЗаписиПоВидуОтчета(ВидОтчета, Отказ = Ложь) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗначенияСтатусовКлючевыхСрезов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ВидОтчета", ВидОтчета);
		Блокировка.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВидОтчета.Установить(ВидОтчета);
		НаборЗаписей.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ОбработатьОшибкуУдаленияЗаписей();
		Отказ = Истина;
		
	КонецПопытки;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы


Процедура ПеренестиЗначенияСтатусовЭкземпляровОтчетов() Экспорт
	
	МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗначенияСтатусовПоказателейСинтетика.ВидОтчета КАК ВидОтчета,
	|	ЗначенияСтатусовПоказателейСинтетика.Сценарий КАК Сценарий,
	|	ЗначенияСтатусовПоказателейСинтетика.ОрганизационнаяЕдиница КАК ОрганизационнаяЕдиница,
	|	ЗначенияСтатусовПоказателейСинтетика.ПериодОтчета КАК ПериодОтчета,
	|	ЗначенияСтатусовПоказателейСинтетика.Проект КАК Проект,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика1 КАК Аналитика1,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика2 КАК Аналитика2,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика3 КАК Аналитика3,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика4 КАК Аналитика4,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика5 КАК Аналитика5,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика6 КАК Аналитика6,
	|	ВЫБОР
	|		КОГДА ЗначенияСтатусовПоказателейСинтетика.ЗначениеЗаблокировано > 1
	|			ТОГДА 1
	|		ИНАЧЕ ЗначенияСтатусовПоказателейСинтетика.ЗначениеЗаблокировано
	|	КОНЕЦ КАК ЗначениеЗаблокировано,
	|	ЗначенияСтатусовПоказателейСинтетика.ИндексСостояния КАК ИндексСостояния
	|ИЗ
	|	РегистрСведений.ЗначенияСтатусовПоказателейСинтетика КАК ЗначенияСтатусовПоказателейСинтетика
	|ГДЕ
	|	ЗначенияСтатусовПоказателейСинтетика.ВидОтчета.ОбъектДляСогласованияЗначений = ЗНАЧЕНИЕ(Перечисление.ОбъектыСогласованияЗначенийПоказателейОтчетов.ЭкземплярОтчета)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗначенияСтатусовПоказателейСинтетика.ВидОтчета,
	|	ЗначенияСтатусовПоказателейСинтетика.Сценарий,
	|	ЗначенияСтатусовПоказателейСинтетика.ОрганизационнаяЕдиница,
	|	ЗначенияСтатусовПоказателейСинтетика.ПериодОтчета,
	|	ЗначенияСтатусовПоказателейСинтетика.Проект,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика1,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика2,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика3,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика4,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика5,
	|	ЗначенияСтатусовПоказателейСинтетика.Аналитика6,
	|	ЗначенияСтатусовПоказателейСинтетика.ИндексСостояния,
	|	ВЫБОР
	|		КОГДА ЗначенияСтатусовПоказателейСинтетика.ЗначениеЗаблокировано > 1
	|			ТОГДА 1
	|		ИНАЧЕ ЗначенияСтатусовПоказателейСинтетика.ЗначениеЗаблокировано
	|	КОНЕЦ
	|ИТОГИ ПО
	|	ВидОтчета";
	
	Результат = Запрос.Выполнить();
	ВыборкаВидОтчета = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидОтчета.Следующий() Цикл
		
		Попытка
			
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВидОтчета.Установить(ВыборкаВидОтчета.ВидОтчета);
			
			Выборка = ВыборкаВидОтчета.Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка)
			КонецЦикла;
			
			ВидОтчетаСтрокой = Строка(ВыборкаВидОтчета.ВидОтчета);
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			
		Исключение
			
			ТекстСообщения = СтрШаблон(НСтр("ru='Не удалось создать записи для вида отчета ""%1"" по причине:
				|%2.'"), ВидОтчетаСтрокой, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,
				МетаданныеРегистра,
				,
				ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПериодыБлокировки(МассивПериодов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивПериодов", МассивПериодов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Периоды.Ссылка КАК ПериодыОтчета
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.Ссылка В (&МассивПериодов)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса;
	
КонецФункции

Процедура ОбработатьОшибкуУдаленияЗаписей()
	
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка удаления записей регистра сведений ""Значения статусов ключевых срезов"" по причине: %1'"),
		ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
	ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка удаления записей регистра сведений ""Значения статусов ключевых срезов"": %1'"),
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка удаления записей регистра сведений ""Значения статусов ключевых срезов""'"),
		УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗначенияСтатусовКлючевыхСрезов,, ТекстОшибки);
	
КонецПроцедуры


#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
#КонецЕсли
